Repository: umar221b/advancedsurvey-xblock
Catalog: advancedsurvey/translations/*/LC_MESSAGES/text.po
Languages: ar

source: Advanced Survey
ar: استبيان

source: The maximum number of times a user may submit the survey.
ar: أكبر عدد من المرات يسمح به للمتعلم للإجابة على الاستبيان.

source: Number of times the user has submitted the survey.
ar: عدد المرات التي قام بها المتعلم بالإجابة على الاستبيان.

source: Text to display after the user submits the survey.
ar: النص الذي سيظهر للمتعلم بعد الإجابة على الاستبيان.

source: Questions for this Survey
ar: أسئلة الاستبيان

source: The user's answers
ar: إجابات المتعلم

source: You have already answered this survey.
ar: قمت بالإجابة على هذا الاستبيان من قبل.

source: You have already answered this survey as many times as you are allowed to.
ar: قمت بالإجابة على هذا الاستبيان أكبر عدد ممكن من المرات.

source: You did not answer all required questions.
ar: لم تقم بالإجابة على كافة الأسئلة المطلوبة.

source: You must add questions.
ar: عليك إضافة أسئلة.

source: Submit
ar: تسليم

source: The submit button will appear here in the LMS.
ar: زر التسليم لا يظهر إلا في منصة المتعلم.

source: Export results to CSV
ar: تحضير النتائج في ملف إكسل

source: Download CSV
ar: تحميل ملف إكسل

source: Student data and results CSV will be available for download in the LMS.
ar: النتائج متاحة للتنزيل كملف إكسل في منصة المتعلم

source: This text will be displayed for the user as feedback after they have submitted their response to the survey.
ar: سيتم عرض هذا النص للمتعلمين بعد تسليم إجابات الاستبيان.

source: Maximum Submissions
ar: أكبر عدد مسموح به من التسليمات

source: Maximum number of times a user may submit the survey. Setting it to 0 will allow infinite resubmissions.
ar: أكبر عدد من المرات مسموح به التسليم. اختيار قيمة 0 سيمسح بعدد غير محدود من التسليمات.

source: Notes:
ar: ملاحظات:

source: If you change an answer's text, all students who voted for that choice will have their votes updated to the new text. You'll want to avoid changing an answer from something like 'True' to 'False', accordingly. If you delete an answer, any votes for that answer will also be deleted. Students whose choices are deleted may vote again, but will not lose course progress.
ar: إذا قمت بتغيير نص إجابة، سيتم تعديل إجابات جميع المتعلمين إلى النص الجديد. لا تقم بتعديل الإجابات بشكل معاكس تماما (مثلا: تعديل صحيح 'صحيح' إلى 'خاطئ'). إذا قمت بحذف إجابة ستحذف إجابات المتعلمين لذلك السؤال وسيستطيعون الإجابة على السؤال مجددا، لكن سيستمر الاستبيان بالظهور كأنه مكتمل.

source: Questions must be similarly cared for. If a question's text is changed, any votes for that question will remain. If a question is deleted, any student who previously took the survey will be permitted to retake it, but will not lose course progress.
ar: يجب الحذر عند تعديل الأسلئة بنفس الطريقة. إذا تم حذف سؤال سيتمكن المتعلمون من إعادة الإجابة على الاستبيان لكن الاستبيان سيستمر بالظهور كأنه مكتمل.

source: Save
ar: حفظ

source: Cancel
ar: إلغاء
